[
    {
        "title": "WilliamFolio",
        "icon": "./resources/images/badges/project/williamfolio-badge.svg",
        "previewDescription": "Website presenting myself, my projects and my experience and skills.",
        "description": [
            "In order to introduce myself, I decided to create a small web page in HTML, CSS and JavaScript to present my projects, my work, my academic and professional background, for people unfamiliar with the Swiss education system. This project also enabled me to learn more about CSS and JavaScript.",
            "All the colors you see on this site were generated by me. This project was a good exercise in understanding the contrasts between the colors used for the background and those used for the content. ",
            "This project also allowed me to explore one of the ways of deploying a project on a remote server, as well as setting up the DNS and the server so that people could see it (Useful for a portfolio 😂)."
        ],
        "year": 2023,
        "type": "Personal Project",
        "demo": "https://williampasquier.ch/portfolio",
        "repo": "https://github.com/WilliamPasquier/WilliamFolio",
        "tags" : [
            "html5",
            "css3",
            "js"
        ],
        "imageUrls": [
            "./resources/images/projects-thumbnails/williamfolio/williamfolio_thumbnail.png"
        ]
    },
    {
        "title": "NTX Project",
        "icon": "./resources/images/badges/project/projectntx-badge.svg",
        "previewDescription": "Ecommerce website used to sell electronic components as an exercise project for learning languages and frameworks ",
        "description": [
            "When I started my company, one of the first projects I was able to do was a sales site for a fictitious company specializing in electronic components called NTX. Serious competition for Intel and AMD. This was the first project that allowed me to experiment with NodeJS and ExpressJS.",
            "The aim was to create a fully functional site, from purchase to support, including a confirmation e-mail for purchases. The whole thing was designed with Bootstrap and Sass (to learn the language).",
            "Although the code is poorly written, it's the first project I've built on my own, and it shows how far I've come."
        ],
        "year": 2020,
        "type": "Personal Project",
        "repo": "https://github.com/WilliamPasquier/project-ntx",
        "tags" : [
            "html5",
            "css3",
            "js",
            "sass",
            "bootstrap",
            "nodejs",
            "expressjs"
        ],
        "imageUrls": [
            "./resources/images/projects-thumbnails/projectntx/projectntx-homepage.png"
        ]
    }
]